Revit 2027 API
UIControlledApplication.IsViewerModeActive Property
 Determines if Revit session is in Viewer mode.
Namespace: Autodesk.Revit.UI
Assembly: RevitAPIUI (in RevitAPIUI.dll) Version: 27.0.4.0 (27.0.4.0)
Syntax
public bool IsViewerModeActive { get; }
Public ReadOnly Property IsViewerModeActive As Boolean
	Get
public:
property bool IsViewerModeActive {
	bool get ();
}
member IsViewerModeActive : bool with get
Property Value
Boolean
See Also
Reference
UIControlledApplication Class
Autodesk.Revit.UI Namespace